app/controllers/api/v1/tasks_controller.rb

  def index
    @tasks = current_user.tasks.includes(:user)
    render json: {
      status: 'SUCCESS',
      message: 'Tasks loaded',
      data: @tasks.map do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 1

  def create
    @task = current_user.tasks.build(task_params)

    if @task.save
---
INSERT INTO "tasks" ("title", "description", "status", "due_date", "user_id", "created_at", "updated_at") VALUES ('Test API Task', 'Testing the API endpoints', 'pending', '2025-09-01 00:00:00', 1, '2025-08-25 21:28:36.220358', '2025-08-25 21:28:36.220358') RETURNING "id"

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "status" = 'completed', "updated_at" = '2025-08-25 21:28:45.870606' WHERE "tasks"."id" = 5